pmo-dataset/graphviz/32.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Farming bot creation\ndesire" -> "Find out wanted\nresources";
  "New milestone\nachieved?" -> "Notify player" [label="Yes"];
  "Help with materials" -> "InclusiveGateway_2";
  "Brag to friends" -> "InclusiveGateway_2";
  "ParallelGateway_1" -> "Check repo for\nalready available\nresources";
  "Check repo for\nalready available\nresources" -> "ParallelGateway_2";
  "ParallelGateway_2" -> "New tools needed?";
  "Build tools" -> "ExclusiveGateway_1";
  "ParallelGateway_1" -> "Collect urgently\nneeded resources";
  "Collect urgently\nneeded resources" -> "ParallelGateway_2";
  "New tools needed?" -> "Build tools" [label="Yes"];
  "ExclusiveGateway_1" -> "Collect the remained\nresources";
  "New tools needed?" -> "ExclusiveGateway_1" [label="No"];
  "Read message" -> "ExclusiveGateway_2";
  "ExclusiveGateway_2" -> "Bot finished?";
  "Reset bot" -> "Continue farming";
  "Start farming" -> "ExclusiveGateway_3";
  "Find out wanted\nresources" -> "ParallelGateway_1";
  "Notify player" -> "Read message";
  "ExclusiveGateway_3" -> "New milestone\nachieved?";
  "Continue farming" -> "ExclusiveGateway_3";
  "Wait for random\nnatural event for\nsome time" -> "RNE happened?";
  "RNE happened?" -> "Reset bot" [label="Yes"];
  "ParallelGateway_3" -> "ExclusiveGateway_4";
  "ExclusiveGateway_4" -> "Wait for random\nnatural event for\nsome time";
  "Collect the remained\nresources" -> "ParallelGateway_3";
  "RNE happened?" -> "Start farming" [label="No"];
  "ParallelGateway_3" -> "Update list of\nresources";
  "New milestone\nachieved?" -> "ExclusiveGateway_2" [label="No"];
  "Give bot a sleeping\nbreak" -> "ExclusiveGateway_4";
  "Bot finished?" -> "InclusiveGateway_1" [label="Yes"];
  "InclusiveGateway_2" -> "ParallelGateway_4";
  "Update list of\nresources" -> "ParallelGateway_4";
  "ParallelGateway_4" -> "EndNoneEvent";
  "Bot finished?" -> "Give bot a sleeping\nbreak" [label="No"];
  "InclusiveGateway_1" -> "Brag to friends" [label="brag"];
  "InclusiveGateway_1" -> "Help with materials" [label="help"];

  subgraph "cluster_Pool_1" {
    label="Farming Bot Game";

    subgraph "cluster_Lane_1" {
      label="Player";
      "Farming bot creation\ndesire";
      "Find out wanted\nresources";
      "Read message";
      "Collect urgently\nneeded resources";
      "Collect the remained\nresources";
      "ParallelGateway_1";
      "Check repo for\nalready available\nresources";
      "ParallelGateway_2";
      "New tools needed?";
      "Build tools";
      "ExclusiveGateway_1";
    }

    subgraph "cluster_Lane_2" {
      label="Farming Bot";
      "Start farming";
      "Continue farming";
      "Reset bot";
      "New milestone\nachieved?";
      "Notify player";
      "ExclusiveGateway_2";
      "Bot finished?";
      "InclusiveGateway_1";
      "Brag to friends";
      "Help with materials";
      "InclusiveGateway_2";
      "Give bot a sleeping\nbreak";
      "ParallelGateway_3";
      "Update list of\nresources";
      "ExclusiveGateway_3";
      "Wait for random\nnatural event for\nsome time";
      "RNE happened?";
      "ExclusiveGateway_4";
      "ParallelGateway_4";
      "EndNoneEvent";
    }
  }

  "Farming bot creation\ndesire" [shape=circle];
  "EndNoneEvent" [label="", shape=circle, penwidth=4];
  "New tools needed?" [shape=diamond];
  "ExclusiveGateway_1" [label="X", shape=diamond];
  "New milestone\nachieved?" [shape=diamond];
  "ExclusiveGateway_2" [label="X", shape=diamond];
  "Bot finished?" [shape=diamond];
  "ExclusiveGateway_3" [label="X", shape=diamond];
  "RNE happened?" [shape=diamond];
  "ExclusiveGateway_4" [label="X", shape=diamond];
  "ParallelGateway_1" [label="+", shape=diamond];
  "ParallelGateway_2" [label="+", shape=diamond];
  "ParallelGateway_3" [label="+", shape=diamond];
  "ParallelGateway_4" [label="+", shape=diamond];
  "InclusiveGateway_1" [label="O", shape=diamond];
  "InclusiveGateway_2" [label="O", shape=diamond];
}
